{"0016":{"id":"0016","name":"Encore Beach Club","short":"A three-tiered pool complex, 'lily pad' water lounges, cabanas, &ampl eight ultraluxe two-story bungalows.","long":"Encore Beach Club Encore Beach Club has set the standard for trendsetters seeking an   upscale and lively pool atmosphere usually found in European hot spots.   The 60,000 square foot venue is a lush oasis featuring 40-foot palm   trees surrounding three tiered pools, daybeds with private safes and 26   cabanas outfitted with refrigerators and flat-screen televisions. Eight   decadent bungalows offer the venue’s most sought after, high-end seating   with private infinity dipping pools, private bathrooms and   temperature-controlled cooling systems. For a cooler spot, guests can choose to lounge on oversized lily pads   resting in shallow water or dance under one of the shower poles. Encore   Beach Club’s gaming pavilion also offers an opportunity to try your   luck at blackjack and craps. Encore Beach Club also features its own   grill available to all patrons.","address":"3121 S Las Vegas Blvd, Las Vegas, NV 89109, United States","latitude":"36.127259","longitude":"-115.165842"},"0017":{"id":"0017","name":"Rehab","short":"Rehab is the original and still the best Las Vegas pool party.","long":"Rehab Las Vegas Everyone knows that some of the best partying in Las Vegas happens daytime poolside. And the ultimate Vegas pool party? The Hard Rock Hotel & Casino invented it with Rehab. The once intimate poolside party has grown into a destination with weekend revelers in the thousands. Get ready for Rock Star Lemonades, world famous DJs, celebrity guests and the best time you&#39;ll have in Vegas. The beautiful, the tattooed, the rich, the famous, large and small; everyone gets down on Rehab Sunday. Come on in, the water is fine! ","address":"4455 Paradise Rd,Las Vegas,NV 89169,United States","latitude":"36.109011","longitude":"-115.153851"},"0018":{"id":"0018","name":"Tao Beach Las Vegas","short":" TAO Beach is one of the hottest daytime experiences in Las Vegas.","long":"Tao Beach Las Vegas Tao Beach at The Venetian transports visitors to an exotic Balinese escape. Upgrades and enhancements mark the outdoor oasis’ fourth year in Las Vegas, with five new exclusive cabanas, additional day beds for lounging and lush horticulture, including forty foot tall bamboo trees highlighting the day to night venue. This year an even greater emphasis will be placed on the music that fuels the party, with the DJ booth taking center stage as a platform for the world renowned DJ talent.","address":"The Venetian, 3355 S Las Vegas Blvd, Las Vegas, NV 89109, United States ","latitude":"36.121452","longitude":"-115.169611"},"0019":{"id":"0019","name":"Wet Republic","short":"Wet Republic redefines poolside entertainment with the vibrancy and energy of Las Vegas","long":"Wet Republic Las Vegas Wet Republic redefines poolside entertainment by combining the vibrancy and energy of Las Vegas with supreme poolside amenities.Wet Republic evokes a sensuous South Beach ambiance with a seductively modern vibe. Setting the standard for entertainment and luxury by thepool, Wet Republic features two spectacular saltwater pools, eight individual pools and spas, exclusive VIP Bungalows, hip party cabanas, spacious daybeds and oversized deluxe chaise lounges.  Mix, mingle and dance in the 2,500-square-foot lounge as world renowned DJs rock the turntables with the hottest beats. Lounge by or in the pool with a cocktail or unwind in the privacy of your very own Bungalow. Celebrities and hot entertainers headline weekly and monthly events...transforming the 4,100 square-foot sundeck into a stage, and making Wet Republic the hottest destination for premier entertainment. Wet Republic is the unrivaled venue that is transforming the Las Vegas pool party scene. It is the must-see, must-experience pool destination. Experience Wet Republic.  ","address":"3799 Las Vegas Blvd S,Las Vegas,NV 89109,United States","latitude":"36.103374","longitude":"-115.169396"},"0035":{"id":"0035","name":"Palms Pool","short":"Every weekend this pool turns into a broiling party of great music and notorious good times","long":"Palms PoolThe Palms pool consists of three pools spanning a massive two acres holding up to 3,000 people. The supreme layout accommodates for all; with a range of deluxe cabanas, waterfalls and poolside gaming. The three bars (the most popular sitting conveniently under the third pool) mean there is no need to wait for long to get food and beverages.  The Palms pool party has quickly built up a reputation for being the place to party on the weekends with their infamous &#34;Ditch Fridays&#34; and &#34;Ditch Saturdays&#34;. These mega pool parties are not to be taken lightly, with flocks of people taking to the waters, splashing around and hanging out. Their live DJ sets and the influx of great performers ranging from P Diddy, Chris Brown, Kendrick Lamar and many more, has seen these weekends really take Vegas by storm. So if your looking for a pool party with a less pretentious setting, a great atmosphere and groups of people looking for a good time, Palms Pool is the place to be.","address":"4321 W Flamingo Rd,Las Vegas,NV 89103,United States","latitude":"36.115381","longitude":"-115.198145"},"0036":{"id":"0036","name":"Marquee Dayclub","short":"Las Vegas Strip pool featuring three-story Bungalow Lofts, complete with cabana, living quarters, and party deck","long":"Marquee Dayclub Rows of  daybeds and lounge chairs stretch out between palm trees on either side of the  main pool. More daybeds line the north and the edges come right up to the water  so you could dangle your feet or rest your arms while you relax in the cool  waves. Beyond  the main pool, in an alcove in the shade of The Cosmopolitan, is a second  watery paradise. A semicircular waterfall pours into a small pool, where  daybeds with translucent curtains stand on stilts in the shallows. On the  opposite end of the pool club, closest to the entrance, is the café and bar,  where Marquee Dayclub serves up fine foods and tasty thirst quenchers and sweet  treats. Fourteen cabanas made of dark wood and decorated in navy, coral and white  flank the club on raised platforms to the north and south.  Each is outfitted  with two loveseats and a central table, made of dark wicker. Each hideaway is  also equipped with a TV, a safe and a refrigerator stocked with complimentary  non-alcoholic beverages like fruit juices and coconut waters. In front of your  cabana is a private infinity hot tub, heated to the perfect temperature.  On  weekdays, Marquee Dayclub is a calm, relaxing retreat. On weekends, it&#39;s a rocking&#39;  party. DJs keep the beat pumping so you can party all day. ","address":"3708 S Las Vegas Blvd,Las Vegas,NV 89109,United States","latitude":"36.10962","longitude":"-115.17321"},"0038":{"id":"0038","name":"Daylight","short":"Daylight, A revolutionary open-air entertainment & nightlife destination combines the best of day & nightlife","long":"Daylight A bright  name in day life is shining in Las Vegas, Daylight Beach Club at Mandalay Bay.  This  massive pool club, which can accommodate up to 5,000 people, takes afternoon  partying to a higher level. Daylight is inspired by the scene in Ibiza, and its  creators plan to foster a sophisticated vibe, complete with fine cuisine and  innovative technology.&nbsp;   With  elements reminiscent of a tropical island, the setting is truly spectacular. A  luxurious 4,400-square-foot pool with three wet decks lies at the heart of the  50,000-square-foot open-air space. Among the accents are authentic Mexican wall  sconces, rustic planters and decorative ironwork. A Mediterranean colour  palette featuring cool shades and organic tones is being utilized in the  furnishings. There are 70 daybeds and 23 cabanas that surround the pool. Plus,  Daylight boasts two bungalows that have their own restrooms, servers and pools.  Daylight  is also home to a 1,500-square-foot stage that has a magnificent sound system and  can produce amazing lighting effects. It&#39;s framed by six huge LED screens as  well. You&#39;ll see the world&#39;s top DJs appear on it. In fact, the beach club  often hosts Eclipse night time parties.  Hungry  and thirsty patrons are delighted by the creative food and beverage menus.  Among the chic cocktails are The Clooney, The Baja and the Daylight White  Sangria. Culinary choices include maki rolls, cucumber rolls and tuna sashimi.","address":"3950 S. Las Vegas Blvd.Las Vegas,NV 89119United States","latitude":"36.09080","longitude":"-115.17278"}}