{"0001":{"id":"0001","name":"Hakkasan Las Vegas","short":"Hakkasan Las Vegas is an invigorating new experience in next generation entertainment and dining.","long":"Hakkasan Hakkasan Nightclub situated in the MGM Hotel Las Vegas, is empowered by its sharp design and signature drapes of Blue. As soon as you walk in, you&rsquo;ll get the feeling that it could just be the start of a very special night! Hakkasan Las Vegas&rsquo; dark interior is furnished with ambience, warm sounds and intelligent lighting; boasting multiple levels, its restaurant on the main floor, which is separated by what&rsquo;s described as The Cage, allows for a unique dining experience. The Nightclub is an unmissable experience that benefits from modern design and deep attention to detail. There are numerous rooms inside the club which allow you to experience different environments or DJ&rsquo;s playing a repertoire of great music.  Hakkasan have set the benchmark high and have fuelled that by signing the world&rsquo;s most renowned DJ&rsquo;s to regular residencies. Hakkasan&rsquo;s main room will take your breath away - no expense is spared in delivering amazing sound and lighting.  Supported by two additional areas, namely the Pavilion and Mezzanine, you are afforded an opportunity to enjoy a more discreet experience. If you have an appetite for even more good times, then take the opportunity to visit Hakkasan&rsquo;s own club in a club experience - The 10,000sq foot Ling Ling club on the 3rd level. Contact us now and we will assist you in organising your stag or hen party like a true VIP inside one of the best nightclubs in Las Vegas. We can organise guest list entry, VIP passes, Bottle service and VIP table service. If you have read enough and can&rsquo;t wait to get your Las Vegas journey started get in touch.","address":"MGM Grand Hotel & Casino3799 Las Vegas Boulevard,South Las Vegas, Nevada89109","latitude":"36.1033743","longitude":"-115.1693962"},"0002":{"id":"0002","name":"Tao","short":"Located in the Venetian Hotel & Casino, TAO Nightclub & Asian Bistro is Las Vegas' hottest nightlife attraction","long":"Tao Located in the beautiful Venetian Hotel and Casino. Tao nightclub and Asian Bistro is home to one of the most exhilarating Dining and Nightclub experience in Las Vegas Tao nightclub, situated inside the Venetian Hotel Las Vegas has been home to one of the biggest party experiences in Vegas for years. Tao entails three elements of entertainment -  A fine dining experience at Tao restaurant One of the most unique nightclub and pool party venues you can find - a nightclub based on three levels allowing you to taylor your own experience A lounge area for more relaxed daytime visits for those looking to view its ancient relics and fascinating statues  Tao Nightclub is truly a must-visit venue, with its beautiful Far East setting complemented with some of the best DJ&rsquo;s and performances. The main level of the club entails two different experiences:  The Opium room which lets you get away from the assiduous setting of the Main room allowing a different taste of music and a more relaxed club experience, The breathtaking main room. When you walk in you are immediately enveloped by all that Tao has to offer, its two levels allow you to absorb the atmosphere from the fantastic light show and sound system  Weather you feel like a drink, a dance or want to enjoy partying with the girls in the hot tubs, Tao is clearly a cut above the rest and as it stands as one of the most iconic party venues in Vegas it has no plan to slow down anytime soon. Contact us now and we will assist you in organising your stag or hen party like a true VIP inside one of the best nightclubs in Las Vegas. We can organise guest list entry, VIP passes, Bottle service and VIP table service. If you have read enough and can&rsquo;t wait to get your Las Vegas journey started get in touch.","address":"3570 S. Las Vegas Blvd,Las Vegas,NV 89109","latitude":"36.117060","longitude":"-115.177875"},"0003":{"id":"0003","name":"The Bank","short":"The Bank is a premiere choice for corporate events, live shows, and private parties","long":"The Bank Nightclub The Bank Nightclub, The Light Group&#39;s newest creation located inside   the Bellagio is Las Vegas&#39; premier nightlife destination, catering to a   discerning audience with higher sensibilities. The Light Group&#39;s   progressive legacy aligned with its unequalled customer service will   ensure that each client will leave with an exceptional experience.  Bank VIP Services The Bank will flawlessly maintain its position as the most desirable   cosmopolitan nightclub in Las Vegas. Like its namesake, The Bank will be   a sanctuary for all things precious – the décor and design are no   exception. Vivid custom-designed ambient and mood lighting on both the   ceiling and floor will create an ultra-sensory experience and   state-of-the-art sound system, built to suit the needs of all music   types, will bring the club to life every night. Simply stated, The Bank is elegant, exclusive and one of Las Vegas&#39;   most desirable places to party.The Bank Nightclub will have Table   Reservations and VIP Admission available to all guests not just VIP. The   Club will feature multiple levels of entertainment almost 3 stories   high, perfect when catering to the masses of Las Vegas. Contact us   anytime for exclusive VIP Table Reservation and VIP Admission into Las   Vegas&#39; most prestine Nightclub venue, The Bank at the Bellagio.","address":"3600 S Las Vegas Blvd,  Las Vegas,  NV 89109,  United States","latitude":"36.113011","longitude":"-115.176522"},"0004":{"id":"0004","name":"Ghostbar","short":"Ghostbar has a sensual, sophisticated vibe featuring an elegant design with a feminine feel.","long":"Ghostbar If you are a &#39;First Timer&#39; to Vegas and want to treat yourself to spectacular views, cool people and funky music then Ghostbar is the place. Found inside the Off-Strip &#39;Palms Hotel&#39;, Ghostbar is 55 floors above Vegas and is a wise choice for those seeking a lounge atmosphere mixed with futuristic furnishings and the occasional Playboy Bunny. Ghostbar still commands a loyal following especially for those staying at the Palms Hotel. If you are one of them then go have a look! But don&#39;t look down, as there is a surprise on the outer Deck. A 1ft. Thick pane of transparent glass separates you and 1000ft. of floor space needless to say it &#39;Breathtaking&#39; to stand above.","address":"55th fl., 4321 W Flamingo Rd, Las Vegas, NV 89103, United States","latitude":"36.110413","longitude":"-115.206701"},"0005":{"id":"0005","name":"Haze","short":"HAZE Nightclub at ARIA is a must-visit nightlife destination on the Las Vegas Strip. ","long":"HazeFusing Technology and Decor into one, Haze Nightclub inside City Center will deliver a clubbing experience equal or better to that of XS inside the Wynn. Haze is expected to take on a similar look but not feel by including a second floor mezzanine which is to wrap around a circular dance floor and VIP area thereby keeping everyone in the action. Like Most Las Vegas Nightclubs Haze will focus on drawing upscale clientele to enjoy its Bottle Service, VIP tables and European Style Decor Haze VIP Services Located inside the Aria Hotel in City Center Las Vegas, Haze will feature an extensive Hallway leading to a grand staircase providing you access to the dance floor below or the mezzanine above. From the Mezzanine night clubbers can preview the &#39;Cirque&#39; like acts being performed on a platform suspended above the dance floor or enjoy some privacy in the vip. The design is delivered by ICRAVE and is expected to include cutting edge lighting and a two story wall of light and panoramic projection screens.","address":"3730 S Las Vegas Blvd, Las Vegas, NV 89109, United States","latitude":"36.107142","longitude":"-115.173666"},"0007":{"id":"0007","name":"Marquee","short":"Marquee Nightclub & Dayclub, a one-of-a- kind experience  from the Tao group.","long":"MarqueeMarquee the renowned nightclub brand from New York is set to open a top the Cosmopolitan Hotel in Las vegas. Sparing no expense the creators of TAO are set to reclaim nightlife stardom by opening the largest nightclub in Las Vegas and for that matter the world.  Club Marquee will focus not only on providing nightlife entertainment but something different as they are to offer a day clubbing experience at the Beach Club. Las Vegas visitors will now have venue to party at during both the day and night.  The Nightclub will be hosted on the mezzanin level of the Cosmopolitan Hotel offering breathtaking views of the Las Vegas Strip and Pool Club which sits beside it. Marquee is set to offer a Pool party experience complete with ultra lounge and high powered nightclub to keep your feet moving for over 12hrs if you can handle it. There are projected to be several rooms each hosting its own private DJ and lounge area inside the club so be sure to book you vip table reservations with us for the best table placement. Marquee VIP Services Located atop the Cosmopolitan Hotel the Marquee will be offering decadent VIP service which includes Bottle & table reservations alongside VIP passes for both male and females. Do not get left out the lines to enter into the largest nightclub in Las Vegas.","address":"3708 S Las Vegas Blvd, Las Vegas, NV 89109, United States","latitude":"36.109622","longitude":"-115.173212"},"0008":{"id":"0008","name":"Chateau Nightclub","short":"A classic modern French-themed nightclub","long":"ChateauChateau Nightclub & Gardens at Paris Las Vegas combines classic French opulence with modern eclectic style, offering a sophisticated and unparalleled nightlife experience in Las Vegas.  Chateau Nightclub & Gardens features a high energy nightclub and outdoor Parisian gardens with magnificent views of the Las Vegas Strip. Sprawled across two stories offering three different experiences, the exclusive nightspot it is sure to entertain the most discriminating of club-goers, offering an elite haven for celebrity guests and &#34;scenesters&#34; alike.","address":"3655 S Las Vegas Blvd,Las Vegas,NV 89109,United States","latitude":"36.111913","longitude":"-115.171270"},"0010":{"id":"0010","name":"Pure","short":"With an unparalleled view of the Las Vegas Strip, PURE symbolizes a new standard in Las Vegas nightlife","long":"Pure Nightclub Ranked amongst the top nightclubs in the States, PURE on any weekend is Awesome! Littered with beautiful people, movie stars and athletes PURE Las Vegas commands ridiculous size crowds packing over 5,000 people in\/out over the course of a Saturday Night. Pure is located inside Caesars Palace next to the Sports Book. The lines form outside the club an hour prior to opening at 10:30pm. For weekends its advised you arrive early unless you have purchased VIP Passes or have made bottle service reservations in advance. The Nightclub venue is comprised of 4 distinct rooms which include the Pussycat Dolls Lounge, Red Room, Terrace &amp; Whiteroom. All rooms inside of PURE Las Vegas have their own DJ spinning various versions of Hip-hop or House. Overall PURE Caesars Palace is one of the Best Vegas Nightclubs. Having Pure Nightclub VIP into the venue is recommended on Weekends and Tuesday Nights. Pure Nightclub Review The Whiteroom is the featured mainroom at PURE. If you are traveling to Las Vegas and want to roll like a VIP then the whiteroom is where it&#39;s at! Bottle service will land you next to top celebrities such as Entourage, Pamela Anderson, Lindsay Lohan and Jackass just to name a few. The &#39;Whiteroom at PURE Las Vegas is for a Pure Nightclub VIP and those looking to be in the scene. The most intensified high energy environment within any Las Vegas Night Club remains the white room. This mainroom is draped in white, everything is white the walls, curtains, seating and Hostesses outfits are all white! PURE Whiteroom is the busiest room in the club and in the #1 requested area for partying in the States.","address":"3570 S Las Vegas Blvd, Las Vegas, NV 89109, United States","latitude":"36.117060","longitude":"-115.177875"},"0012":{"id":"0012","name":"Surrender","short":"Surrender Nightclub is known for showcasing the world's best electronic music talent. ","long":"Surrender Nightclub Surrender Nightclub is Las Vegas&rsquo; newest hottest nightlife   destination, a groundbreaking indoor\/outdoor venue unlike any other. The   Venue has quickly established itself as the go-to destination for   upscale nightlife in Las Vegas. The Surrender experience starts indoors   where guests are lured into temptation by the club&rsquo;s signature 120-foot   long sleek silver snake, resting behind the venues main bar. Plush banquettes and VIP seating overlooks and energetic dance floor   surrounded by eight platforms, where Surrender&rsquo;s beautiful team of go-go   dancers are stationed. The décor of Surrender expertly blends the   enticing theme with the upscale standards guests have come to expect   from Encore Las Vegas properties","address":"3131 S Las Vegas Blvd, Las Vegas, NV 89109, United States","latitude":"36.127501","longitude":"-115.165916"},"0013":{"id":"0013","name":"Tryst Nightclub","short":"Voted 2011 Nightclub of the Year by the Nightclub &amp; Bar Awards. Experience A-list nightlife at its best in Las Vegas","long":"Tryst Nightclub Found within the Wynn Hotel past the bell desk, buried beneath a   Japanese restaurant on the basement floor exists the most extravagant   high class nightclub, Tryst. With an open aired venue and vip sections   the club is able to mix the elements of humanity and nature into one.   Tryst Las Vegas delivers a clubbing experience that has long been hoped   for amongst Vegas visitors. With over eighty vip tables and a capacity   of handling almost 2,000 guests, Tryst Vegas will continue to remain a   notable night club for years to come. Its important to note crowds are   in excess on weekends please reserve bottle service or VIP Passes in   advance. Tryst VIP Services In order to enjoy the club at its finest there is no better way than to   do it in the VIP. Bottle Reservations and VIP Passes are common services   offered for the nightclub. Tryst is very strict at the front door so   unless you have a VIP pass or are a high roller at the Wynn hotel you   will remain in line for some time. VIP Passes entitle your party to Line   skip and Admission privileges. Tryst Bottle Service includes a table   for sitting and requires a minimum purchase amount depending on the size   of your party. Tryst Wynn Vegas Bottle Service and Guest list can be   booked directly through our site, please click on the link above to   contact us directly. ","address":"3131 S Las Vegas Blvd, Las Vegas, NV 89109, United States","latitude":"36.127501","longitude":"-115.165916"},"0015":{"id":"0015","name":"XS","short":"XS provides an elegant and passionate club environment that surrounds Encore's sparkling pool.","long":"XS Nightclub The reviews are in and XS the Nightclub has revolutionized nightlife in   Las Vegas. The venue incorporates all the best features of its sister   venue TRYST inside the Wynn Hotel with a dancer floor centered in the   middle of the nightclub amidst water accents all around. With 3   different rooms including a Lounge, Main room and Pool. XS remains the   largest Nightclub in Las Vegas with a capacity of over 3000 persons   larger then Haze and PURE. The club merges all the senses by offering   Top Dj&#39;s, In door and Out Door Dancing and the ability to enjoy a dip in   the swimming pool during club hours. Forreservations at XS Las Vegas   see our available options below or contact us directly.  XS VIP Services The standard for Nightclub elegance is awarded to XS Las Vegas. The dual   partying environment offered allows for your party to enjoy dancing in a   high powered mainroom or be social and mingle out on the pool terrace.   XS is located inside the Encore Hotel and is nothing less then stunning.   The venue is plated in gold with glass chandeliers, euro furnishings   with a dark purple accented ambiance. ","address":"3121 S Las Vegas Blvd, Las Vegas, Nevada 89109, United States","latitude":"36.168247","longitude":"-115.140646"},"0033":{"id":"0033","name":"1OAK Las Vegas","short":"1Oak Nightclub is a flavor of New York with a splash of vegas nightlife","long":"1OAK Nightclub Las Vegas 1OAK Nightclub Las Vegas is situated inside the Mirage  Hotel, the owner description of 1OAK is that it &ldquo;Embodies chic, world class  service and the ultimate in after dark innovation, as we introduce the Las  Vegas nightlife scene to the excitement and sophistication of a new York City  style night out&rdquo;   1OAK is a very intimate Nightclub with a world class  Light and sound system and stripper poles which adds to the clubs already sexy  image. 1OAK Las Vegas host to some of the world&rsquo;s hottest talents in the music  industry and unannounced appearances from A-List celebrities.  1OAK is a Nightclub bringing that Exclusive and VIP feel  from New York into Las Vegas, with Vegas truly making the club its own. Every  club claims to be unique but 1OAK is One of a Kind.  Expect to get your dance on to a  combination of electronic, hip-hop and Top 40 in rotation, with more options on  two-room nights and guest performances leaning toward pop and hip-hop artists.&nbsp;   One thing you&#39;ll notice upon entry is that  1 OAK is dark – and this isn&#39;t just a statement of the obvious about pretty  much every nightclub&#39;s lighting.   The club hasn&#39;t simply turned the lights  down, but the walls are black and the accents are all in dark tones, with aged  brass framing much of the artwork on display. The artwork, created by famous  artist Roy Nachum, adds a sexy vibe to an already intimate venue.  The  centrally located dance floor is right up against the DJ booth, close enough to  the main bar to grab a drink without having to make a long trek back when your  favorite jam is playing. VIPs can get a table up close to the dance floor, or  some more secluded seating near the second bar, as well. Performers get a spot  near the main dance floor, so you can keep close to the action.  If the  thought of an intimate, sophisticated nightclub experience excites you, go  ahead and put on your favorite outfit for a special night out. Every club is  unique, but 1 OAK is... Well, we already went over that.","address":"3400 S. Las Vegas Blvd.Las Vegas,NV 89109United States","latitude":"36.12120","longitude":"-115.17407"},"0034":{"id":"0034","name":"Hyde Nightclub","short":"Hyde at Bellagio marks a nightlife experience in Las Vegas from globally acclaimed design icon Philippe Starck","long":"Hyde Nightclub belongs to the Light group and brings a metropolitan flair to the Las Vegas nightlife, with old world touches inspired by an Italian Villa, Books, paintings, chandeliers and fine marble tiles are among the small, but plentiful details that giveHyde its upscale feel.  Even the elevated DJ booth is class with an edgy touch, with a wall of turned-over pewter candlesticks behind the DJ, whose booth also serves as a fireplace.For those looking to start their nightlife party early, the venue opens at dinner time, but only about half of the club is accessible before 10 p.m. After 10, things get kicking as the partition rises and the full nightlife potential of Hyde Bellagio is unlocked.Hyde isn&#39;t a place for overly loud beats and shouted, half-remembered conversations. The venue&#39;s appeal lies in its subtle refinements and changes over the &#39;typical&#39; nightlife experience. For starters, there is no dedicated dance floor, but instead, enough room in and around the booths and tables to dance.Since every club needs a &#39;feature&#39; Hyde overlooks the Fountains of Bellagio, which are visible from almost anywhere in the venue. The balcony is perfect spot for an up close view. The VIP booth in particular, which lies closest to the fountains, is boundto be the hotspot within a hotspot, and envy of every other guest.","address":"3600 S Las Vegas Blvd,Las Vegas,NV 89109,United States","latitude":"36.11301","longitude":"-115.17652"},"0037":{"id":"0037","name":"Light","short":"Light is the first-ever nightclub turned on by the creative minds behind Cirque du Soleil","long":"Light Light, the first-ever nightclub turned on by Cirque  du Soleil, at Mandalay Bay, merges cutting-edge  creativity with incredible music to produce a new kind of nightlife experience.  Headlining DJs &amp; performers lead the charge, coupled with exclusively built  performance elements &amp; visuals, innovative video mapping, lighting, sound  &amp; special effects, as well as avant-garde costumes &amp; unique  choreography. The nightclub also has the largest general admission dance floor  in Las Vegas. Plus, Light features an exclusive lineup of world-renowned DJs  An  evening spent here is sure to indulge all of your senses, thanks to  custom-built staging and visual elements created by the special effects experts  at Moment Factory. At Light an atmosphere is fostered where everyone in the  club feels like they are part of the evening&#39;s show.","address":"3950 Las Vegas,NV 89119,United States","latitude":"36.08089","longitude":"-115.11941"}}